In [4]:
import numpy as np
import pandas as pd

In [5]:
"""
TOPICS:
How to handle missing values in a dataframe?
1. Ignore missing values. 
2. Removing missing values
3. Fill in the missing values
"""

'\nTOPICS:\nHow to handle missing values in a dataframe?\n1. Ignore missing values. \n2. Removing missing values\n3. Fill in the missing values\n'

In [6]:
df = pd.DataFrame({'A' : [1, 2, np.nan, 4] , 
                   'B' : [5, np.nan, np.nan, 8],
                   'C' : [10, 20, 30, 40]})
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [ ]:
#df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

In [7]:
#Drop missing values across rows
df.dropna() #axis = 0

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [8]:
#Drop missing values across columns
df.dropna(axis = 1)

    C
0  10
1  20
2  30
3  40

In [13]:
#Drop values based on threshold of missing values
#Require that many non-NA values
df.dropna(axis = 1, thresh=2) # Do not drop if  atleast 2 non NaN values

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [15]:
#Drop values based on threshold of missing values
#Require that many non-NA values
df.dropna(axis = 1, thresh=3) # Do not drop if  atleast 3 (valid) non NaN values
#since column B has only 2 non NaN values, it will be dropped

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [16]:
#Fill in the missing values

In [17]:
#fill missing values with given value
df.fillna(value = 'FILL_VALUE')

            A           B   C
0           1           5  10
1           2  FILL_VALUE  20
2  FILL_VALUE  FILL_VALUE  30
3           4           8  40

In [18]:
#fill missing values with given value
df.fillna(value = 0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [19]:
#fill missing elements in a series
df['A'].fillna(value = 0)

0    1.0
1    2.0
2    0.0
3    4.0
Name: A, dtype: float64

In [21]:
#fill missing values in column with average value of the series
df['A'].fillna(value = df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
Name: A, dtype: float64

In [22]:
#fill with dataframe mean (mean for each column)
df.fillna(value = df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40